{
  "aboutMe1": "My love for programming has been evolving since I started my studies in college to receive my Bachelor's Degree in Computer Engineering. It began with programming microcontrollers and embedded systems while focusing on hardware, moved on to software product design in my final year of undergradute studies with a major emphasis on software, and now web development where I guess you can say I've completely switched sides and haven't wanted to stop since.",
  "aboutMe2": "Web development is something I'm completely invested in now and will continue to pursue moving forward. I love being able to use my creativity along with my passion for programming web and mobile interfaces to build and develop projects for a better tomorrow.",
  "homeCard1": "Recently taken a keen interest in web development and making the internet look a little more exciting.",
  "homeCard2": "Building more than just websites with basically anything that sparks my interest at the time.",
  "homeCard3": "I think 14 years of playing guitar has earned me the right to say I'm pretty into music, no?",
  "homePanel1": "Basically living on my computer, I spend my time focusing on becoming a web developer nowadays. My degree in computer engineering introduced me to everything from the hardware to software side but pure code is what caught my eye the most in the end. There's just something intriguing about being in complete control of every little detail for a website. To find out more about the work that I have done in the past and am currently working on, check out the <a href='/#/professional'>professional</a> section.",
  "homePanel2": "I can't get through the day without listening to music and I'm always trying to expand my music library. Playing guitar is my favorite thing to do to wind down and is a part of my daily routine. Being a video game collector also keeps me occupied every now and then. To give everyone a slightly more personal look into my life, I'll update things such as what I'm currently listening to for the week and maybe game pickups over on <a href='/#/personal'>personal</a>. Who knows, maybe some guitar covers will start popping up along the way too."
}