{
  "aboutMe1": "My love for programming has been evolving since I started my studies in college to receive my Bachelor's Degree in Computer Engineering. It began with programming microcontrollers and embedded systems while focusing on hardware, moved on to software product design in my final year of undergradute studies with a major emphasis on software, and now web development where I guess you can say I've completely switched sides and haven't wanted to stop since.",
  "aboutMe2": "Web development is something I'm completely invested in now and will continue to pursue moving forward. I love being able to use my creativity along with my passion for programming web and mobile interfaces to build and develop projects for a better tomorrow.",
  "homeCard1": "Recently taken a keen interest in web development and making the internet look a little more exciting.",
  "homeCard2": "Building more than just websites with basically anything that sparks my interest at the time.",
  "homeCard3": "I think 18 years of playing guitar has earned me the right to say I'm pretty into music, no?",
  "homePanel1": "Basically living on my computer, I spend my time focusing on becoming a web developer nowadays. My degree in computer engineering introduced me to everything from the hardware to software side but pure code is what caught my eye the most in the end. There's just something intriguing about being in complete control of every little detail for a website. To find out more about the work that I have done in the past and am currently working on, check out the <a href='/#/professional'>professional</a> section.",
  "homePanel2": "I can't get through the day without listening to music and I'm always trying to expand my music library. Playing guitar is my favorite thing to do to wind down and is a part of my daily routine. Being a video game collector also keeps me occupied every now and then. To give everyone a slightly more personal look into my life, I'll update things such as what I'm currently listening to for the week and maybe game pickups over on <a href='/#/personal'>personal</a>. Who knows, maybe some guitar covers will start popping up along the way too.",
  "experienceAxoni": "At my most recent role, I worked on developing new features on a primary markets platform using functional programming with React. This included rebuilding and expanding upon a 3-year-old JavaScript application in TypeScript while adding support for high-yield bonds. I was also able to add to the user experience by updating our dashboards through use of AG Grid. During downtime, time was spent improving testing utilities while increasing total code coverage of the application from 60% to 76%. Similar to my previous roles, this involved a high level of collaboration in an agile environment to ensure a steady release of features.",
  "experienceOwnedOutcomes": "I was previously a frontend engineer at Owned Outcomes where I had the opportunity to develop web applications for healthcare. It gave me the chance to hone in on technologies which I was already using but also exposed me to new technologies and tools which I continue to use to this day. Throughout my time there, I ended up becoming the lead contributor on the frontend team for our applications which involved refactoring and expanding on features of our data visualization software. Due to being a startup, I had the opportunity to work closely across disciplines during the design process of our products and build a deeper understanding of backend, testing, and product management requirements. This led to my growth in leadership and communication while working at the center of production to provide clients with the best user experience possible. It allowed me to improve on my previous frontend skills and learn new technologies along the way.",
  "experienceUndergrad": "During the last two years of my undergrad studies, I became a research assistant under <a target=\"_blank\" href=\"http://cmosedu.com/\">Dr. R. Jacob Baker</a>. Although the research was done within the electrical engineering department, which I did some chip design in the C5 process, I was able to work with these chips using multiple microcontrollers in C++ and FPGA-development boards in Verilog. Several projects were constantly being worked on in our team which provided me with real-world experience through project management.",
  "profProject1": "The website you’re currently viewing was my first stamp in the web development world but certainly not the last. After spending some time learning the basics of web development, I thought there wouldn’t be a better way to put my skills to the test than to create my own website. Not only does this project showcase some of my skills, it also serves as the beginning of my portfolio.",
  "profProject2": "Worked with a team of eight to implement a modern parking garage/lot system. My responsibilities included the programming of hardware stations in C++ to simulate a working environment which communicated with our database. I also wrote Python scripts which pushed data to the Firebase database to enhance and speed up the testing of the system on every platform. This projected was awarded <a target=\"_blank\" href=\"https://www.facebook.com/unlvengineering/photos/a.1520621151290225/1520632724622401/?type=3&amp;theater\">2nd Place</a> in the Computer Science Senior Design Category at UNLV.",
  "profProject3": "This project focused on the implementation of a loadshare algorithm which involved creating a SCADA system. My responsibilities included interfacing a Real-Time Automation Controller with multiple power devices on the microgrid to create logs and store them on a local server. A PC startup script in Python was created to parse these files and push them to a database using MySQL. This projected was awarded <a target=\"_blank\" href=\"https://www.facebook.com/unlvengineering/photos/a.1520621151290225/1520632404622433/?type=3&amp;theater\">2nd Place</a> in the Electrical and Computer Engineering Senior Design Category at UNLV.",
  "profSkillSum1": "My programming skillset began with C++ and OOP during my undergraduate studies. This evolved into including scripting languages such as Python to go along with embedded systems. Everything I learned while obtaining my degree was enough to make an easy transition to the web development world and starting front end development with JavaScript, HTML, and CSS.",
  "profSkillSum2": "VS Code is my go to IDE and I'm currently in the process of trying to come up with web applications and features to implement on this site that would be interesting and beneficial to learn at the same time."
}